rcd-dpeng/skillBuildingSheet5/RpiMIB/RpiMIB.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "MISO_1_aliases.h"
#include "MISO_1.h"
#include "SCLK_1_aliases.h"
#include "SCLK_1.h"
#include "MOSI_1_aliases.h"
#include "MOSI_1.h"
#include "SPIM_1.h"
#include "SPIM_1_PVT.h"
#include "cs_1a_aliases.h"
#include "cs_1a.h"
#include "EnableBattery.h"
#include "enable_battery_aliases.h"
#include "enable_battery.h"
#include "Comp_1.h"
#include "Supply_monitor_aliases.h"
#include "Supply_monitor.h"
#include "RpiInterrupts.h"
#include "en_level_shift_aliases.h"
#include "en_level_shift.h"
#include "Clock_1.h"
#include "Status_Reg_1.h"
#include "rpi_inta_aliases.h"
#include "rpi_inta.h"
#include "rpi_intb_aliases.h"
#include "rpi_intb.h"
#include "Control_Reg_SS_1.h"
#include "cs_1b_aliases.h"
#include "cs_1b.h"
#include "cs_1c_aliases.h"
#include "cs_1c.h"
#include "Rpi_ss_aliases.h"
#include "Rpi_ss.h"
#include "Rpi_sclk_aliases.h"
#include "Rpi_sclk.h"
#include "Rpi_mosi_aliases.h"
#include "Rpi_mosi.h"
#include "SPIS.h"
#include "SPIS_PVT.h"
#include "Rpi_miso_aliases.h"
#include "Rpi_miso.h"
#include "isr_SS_Rise.h"
#include "SDA_2_aliases.h"
#include "SDA_2.h"
#include "SCL_2_aliases.h"
#include "SCL_2.h"
#include "I2C_1.h"
#include "I2C_1_PVT.h"
#include "MISO_2_aliases.h"
#include "MISO_2.h"
#include "MOSI_2_aliases.h"
#include "MOSI_2.h"
#include "SCLK_2_aliases.h"
#include "SCLK_2.h"
#include "SPIM_2.h"
#include "SPIM_2_PVT.h"
#include "cs_2a_aliases.h"
#include "cs_2a.h"
#include "Control_Reg_SS_2.h"
#include "cs_2b_aliases.h"
#include "cs_2b.h"
#include "cs_2c_aliases.h"
#include "cs_2c.h"
#include "isr_SS_Fall.h"
#include "PWM_1.h"
#include "Clock_2.h"
#include "PWM_2.h"
#include "pwm_a_aliases.h"
#include "pwm_a.h"
#include "pwm_b_aliases.h"
#include "pwm_b.h"
#include "Clock_3.h"
#include "GPIO_Control_Reg.h"
#include "GPIO_0_aliases.h"
#include "GPIO_0.h"
#include "GPIO_3_aliases.h"
#include "GPIO_3.h"
#include "GPIO_2_aliases.h"
#include "GPIO_2.h"
#include "GPIO_Status_Reg.h"
#include "GPIO_1_aliases.h"
#include "GPIO_1.h"
#include "I2C_2.h"
#include "I2C_2_PVT.h"
#include "SDA_1_aliases.h"
#include "SDA_1.h"
#include "SCL_1_aliases.h"
#include "SCL_1.h"
#include "SPIM_1_IntClock.h"
#include "SPIS_IntClock.h"
#include "I2C_1_IntClock.h"
#include "SPIM_2_IntClock.h"
#include "I2C_2_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

